console.log('number' + 3 + 3) //результат "number33" - додавання символів (конкатенація) 

console.log (null + 3) //результат "3" - порожнє значення додаємо до числа 3 

console.log (5 && "qwerty") // результат "qwerty" - здійснюємо операцію "and", де виводиться останнє істине значення 

console.log (+'40' + +'2' + "hillel") //результат 

// '10' - 5 === 6;

// true + false

// '4px' - 3

// '4' - 3

// '6' + 3 ** 0;

// 12 / '6'

// '10' + (5 === 6);

// null == ''

// 3 ** (9 / 3);

// !!'false' == !!'true'

// 0 || '0' && 1

// (+null == false) < 1;

// false && true || true

// false && (false || true);

// (+null == false) < 1 ** 5;
